Revit 2027 API
FabricationServiceSettings.SetFluidTypeAndTemperature Method
 Sets the fluid type and temperature of the specified service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFluidTypeAndTemperature(
	FabricationService service,
	ElementId fluidId,
	double temperature
)
Public Sub SetFluidTypeAndTemperature (
	service As FabricationService,
	fluidId As ElementId,
	temperature As Double
)
public:
void SetFluidTypeAndTemperature(
	FabricationService^ service,
	ElementId^ fluidId,
	double temperature
)
member SetFluidTypeAndTemperature :
        service : FabricationService *
        fluidId : ElementId *
        temperature : float -> unit
Parameters
service FabricationService
 The fabrication service to be set.
fluidId ElementId
 The fluid type id.
temperature Double
 The temperature in Kelvin.
Exceptions
Exception | Condition
ArgumentException |  fluidId is not a fluid type. -or- The temperature is not defined for the fluidId fluid type.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace